<?php

return array (
  'backend' => 
  array (
    'roles' => 
    array (
      'created' => '.لقد تم إضافة الدور الجديد بنجاح',
      'deleted' => 'لقد تم مسح الدور بنجاح.',
      'updated' => 'تم تعديل الدور بنجاح.',
    ),
    'users' => 
    array (
      'cant_resend_confirmation' => 'تم تعيين التطبيق حاليًا للموافقة يدويًا على المستخدمين.',
      'confirmation_email' => 'لقد تم إرسال رسالة تأكيد جديدة إلى عنوان البريد الألكتروني الموجود في الملف الشخصي.',
      'confirmed' => 'تم تأكيد المستخدم بنجاح.',
      'created' => 'لقد تم إنشاء المستخدم الجديد بنجاح.',
      'deleted' => 'لقد تم إزالة المستخدم بنجاح.',
      'deleted_permanently' => 'لقد تم حذف المستخدم نهائيا بنجاح.',
      'restored' => 'لقد تمت استعادة المستخدم بنجاح.',
      'session_cleared' => 'تم مسح جلسة المستخدم بنجاح.',
      'social_deleted' => 'تم حذف الحساب الاجتماعي بنجاح',
      'unconfirmed' => 'تم إلغاء تأكيد المستخدم بنجاح',
      'updated' => 'لقد تم تعديل المستخدم بنجاح.',
      'updated_password' => 'لقد تم تعديل كلمة مرور المستخدم بنجاح.',
    ),
  ),
  'frontend' => 
  array (
    'contact' => 
    array (
      'sent' => 'تم إرسال المعلومات الخاصة بك بنجاح. سنرد مرة أخرى على البريد الإلكتروني المقدم بأسرع ما يمكن.',
    ),
  ),
);
