<?php

return array (
  'backend' =>
  array (
    'access' =>
    array (
      'roles' =>
      array (
        'already_exists' => 'هذا الدور موجود مسبقا. برجاء إختيار إسم آخر.',
        'cant_delete_admin' => 'لا يمكنك إزالة دور الإداري.',
        'create_error' => 'حدثت مشكلة أثناء إنشاء الدور، برجاء المحاولة مرة أخرى.',
        'delete_error' => 'حدثت مشكلة أثناء مسح الدور، برجاء إعادة المحاولة مرى أخرى.',
        'has_users' => 'لا يمكنك مسح هذا الدور وهناك مستخدمين مرتبطين به.',
        'needs_permission' => 'يجب عليك على الأقل إختيار صلاحية واحدة لهذا الدور.',
        'not_found' => 'هذا الدور غير موجود.',
        'update_error' => 'هناك مشكلة في تحديث هذا الدور، برجاء المحاولة مرة أخرى.',
      ),
      'users' =>
      array (
        'already_confirmed' => 'تم تأكيد هذا المستخدم بالفعل.',
        'cant_confirm' => 'حدثت مشكلة في تأكيد حساب المستخدم.',
        'cant_deactivate_self' => 'لا يمكنك فعل هذا بنفسك.',
        'cant_delete_admin' => 'لا يمكنك حذف المشرفين المتميزين.',
        'cant_delete_self' => 'لا يمكنك مسح نفسك.',
        'cant_delete_own_session' => 'لا يمكنك حذف الجلسة الخاصة بك.',
        'cant_restore' => 'لا يتم حذف هذا المستخدم لذلك لا يمكن استعادته.',
        'cant_unconfirm_admin' => 'لا يمكنك إلغاء تأكيد المسؤول الفائق.',
        'cant_unconfirm_self' => 'لا يمكنك إلغاء تأكيد نفسك.',
        'create_error' => 'حدثت مشكلة أثناء إنشاء المستخدم، برجاء المحاولة مرة أخرى.',
        'delete_error' => 'حدثت مشكلة أثناء مسح المستخدم، برجاء المحاولة مرى أخرى .',
        'delete_first' => 'يجب حذف هذا المستخدم أولاً قبل إتلافه نهائيًا.',
        'email_error' => 'هذا البريد الإلكتروني ينتمي إلا مستخدم آخر.',
        'mark_error' => 'حدثت مشكلة أثناء تحديث هذا المستخدم، برجاء المحاولة مرى أخرى.',
        'not_confirmed' => 'لم يتم تأكيد هذا المستخدم.',
        'not_found' => 'هذا المستخدم غير موجود.',
        'restore_error' => 'حدثت مشكلة أثناء إستعادة المستخدم، برجاء المحاولة مرة أخرى',
        'role_needed_create' => 'يجب عليك اختيار دور واحد.',
        'role_needed' => 'يجب عليك إختيار دور واحد على الأقل.',
        'social_delete_error' => 'حدثت مشكلة أثناء إزالة الحساب الاجتماعي من المستخدم.',
        'update_error' => 'حدثت مشكلة أثناء تحديث المستخدم، برجاء المحاولة مرة أخرى.',
        'update_password_error' => 'حدثت مشكلة أثناء تغيير كلمة مرور المستخدم، برجاء المحاولة مرة أخرى.',
      ),
    ),
  ),
  'frontend' =>
  array (
    'auth' =>
    array (
      'confirmation' =>
      array (
        'already_confirmed' => 'حسابك مفعل بالفعل.',
        'confirm' => 'برجاء القيام بتفعيل حسابك!',
        'created_confirm' => 'لقد تم إنشاء حسابك بنجاح. لقد تم إرسال بريد التفعيل إلى بريدك الإلكتروني.',
        'created_pending' => 'تم إنشاء حسابك بنجاح وهو في انتظار الموافقة. سيتم إرسال بريد إلكتروني عند الموافقة على حسابك.',
        'mismatch' => 'كود التفعيل هذا غير متطابق!',
        'not_found' => 'كود التفعيل هذا غير موجود!',
        'pending' => 'حسابك في انتظار الموافقة حاليًا.',
        'resend' => 'حسابك غير مفعل. برجاء الضغط على رابط التفعيل الذي تم إرساله إلى بريدك الإلكتروني, أو <a href=":url">إضغط هنا</a> لإعادة إرسال رابط التفعيل مجددا.',
        'success' => 'تم تفعيل حسابك بنجاح!',
        'resent' => 'تم إرسال رابط التفعيل مجددا إلى عنوان بريدك الإلكتروني الموجود في حسابك.',
      ),
      'deactivated' => 'حسابك بإنتظار الموافقة',
      'email_taken' => 'هذا البريد الإلكتروني موجود مسبقا.',
      'password' =>
      array (
        'change_mismatch' => 'هذه ليست كلمة مرورك القديمة.',
        'reset_problem' => 'حدثت مشكلة في إعادة تعيين كلمة المرور الخاصة بك. يرجى إعادة إرسال البريد الإلكتروني لإعادة تعيين كلمة المرور.',
      ),
      'registration_disabled' => 'التسجيل مغلق حاليًا.',
    ),
  ),
);
